Revit 2027 API
AnalysisDisplayStyleVectorArrowheadScale Enumeration
 Defines arrow head scaling for vector settings of analysis display style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AnalysisDisplayStyleVectorArrowheadScale
Public Enumeration AnalysisDisplayStyleVectorArrowheadScale
public enum class AnalysisDisplayStyleVectorArrowheadScale
type AnalysisDisplayStyleVectorArrowheadScale
Members
Member name | Value | Description
Length10Percent | 2
Length15Percent | 3
Length20Percent | 4
Length5Percent | 1
NoArrow | 5
NoScaling | 0
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace